Revit 2024 API
FailureDefinitionId Members
The FailureDefinitionId type exposes the following members.
Constructors
Name | Description
FailureDefinitionId
Creates a new FailureDefinitionId instance.
Methods
Name | Description
Equals
 Compares two Guid-based enum object based on their concrete class and GUID value.
 (Inherited from GuidEnum.)
GetHashCode
 Generates a hash code for this Guid-based enum object.
 (Inherited from GuidEnum.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Operators
Name | Description
Equality
Compares two FailureDefinitionId instances.
Inequality
Compares two FailureDefinitionId instances.
Properties
Name | Description
Guid
 The Guid of GUID-based enum object.
 (Inherited from GuidEnum.)
See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace